una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7x512.h
/* - ----------------------------------------------------------------------------*/
/* -          ATMEL Microcontroller Software Support  -  ROUSSET  -*/
/* - ----------------------------------------------------------------------------*/
/* -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR*/
/* -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF*/
/* -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE*/
/* -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,*/
/* -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT*/
/* -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,*/
/* -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF*/
/* -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING*/
/* -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,*/
/* -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.*/
/* - ----------------------------------------------------------------------------*/
/* - File Name           : AT91SAM7X512.h*/
/* - Object              : AT91SAM7X512 definitions*/
/* - Generated           : AT91 SW Application Group  01/16/2006 (16:36:26)*/
/* - */
/* - CVS Reference       : /AT91SAM7X512.pl/1.6/Fri Jan  6 08:52:15 2006  */
/* - CVS Reference       : /SYS_SAM7X.pl/1.3/Tue Feb  1 17:01:43 2005  */
/* - CVS Reference       : /MC_SAM7SE.pl/1.8/Fri Nov 18 10:42:25 2005  */
/* - CVS Reference       : /PMC_SAM7X.pl/1.4/Tue Feb  8 13:58:10 2005  */
/* - CVS Reference       : /RSTC_SAM7X.pl/1.2/Wed Jul 13 14:57:50 2005  */
/* - CVS Reference       : /UDP_SAM7X.pl/1.1/Tue May 10 11:35:35 2005  */
/* - CVS Reference       : /PWM_SAM7X.pl/1.1/Tue May 10 11:53:07 2005  */
/* - CVS Reference       : /AIC_6075B.pl/1.3/Fri May 20 14:01:30 2005  */
/* - CVS Reference       : /PIO_6057A.pl/1.2/Thu Feb  3 10:18:28 2005  */
/* - CVS Reference       : /RTTC_6081A.pl/1.2/Tue Nov  9 14:43:58 2004  */
/* - CVS Reference       : /PITC_6079A.pl/1.2/Tue Nov  9 14:43:56 2004  */
/* - CVS Reference       : /WDTC_6080A.pl/1.3/Tue Nov  9 14:44:00 2004  */
/* - CVS Reference       : /VREG_6085B.pl/1.1/Tue Feb  1 16:05:48 2005  */
/* - CVS Reference       : /PDC_6074C.pl/1.2/Thu Feb  3 08:48:54 2005  */
/* - CVS Reference       : /DBGU_6059D.pl/1.1/Mon Jan 31 13:15:32 2005  */
/* - CVS Reference       : /SPI_6088D.pl/1.3/Fri May 20 14:08:59 2005  */
/* - CVS Reference       : /US_6089C.pl/1.1/Mon Jul 12 18:23:26 2004  */
/* - CVS Reference       : /SSC_6078B.pl/1.1/Wed Jul 13 15:19:19 2005  */
/* - CVS Reference       : /TWI_6061A.pl/1.1/Tue Jul 13 07:38:06 2004  */
/* - CVS Reference       : /TC_6082A.pl/1.7/Fri Mar 11 12:52:17 2005  */
/* - CVS Reference       : /CAN_6019B.pl/1.1/Tue Mar  8 12:42:22 2005  */
/* - CVS Reference       : /EMACB_6119A.pl/1.6/Wed Jul 13 15:05:35 2005  */
/* - CVS Reference       : /ADC_6051C.pl/1.1/Fri Oct 17 09:12:38 2003  */
/* - ----------------------------------------------------------------------------*/

#ifndef AT91SAM7X512_H
#define AT91SAM7X512_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;/* Hardware register definition*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* ******************************************************************************/
typedef struct _AT91S_SYS {
	AT91_REG	 AIC_SMR[32]; 	/* Source Mode Register*/
	AT91_REG	 AIC_SVR[32]; 	/* Source Vector Register*/
	AT91_REG	 AIC_IVR; 	/* IRQ Vector Register*/
	AT91_REG	 AIC_FVR; 	/* FIQ Vector Register*/
	AT91_REG	 AIC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 AIC_IPR; 	/* Interrupt Pending Register*/
	AT91_REG	 AIC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 AIC_CISR; 	/* Core Interrupt Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AIC_IECR; 	/* Interrupt Enable Command Register*/
	AT91_REG	 AIC_IDCR; 	/* Interrupt Disable Command Register*/
	AT91_REG	 AIC_ICCR; 	/* Interrupt Clear Command Register*/
	AT91_REG	 AIC_ISCR; 	/* Interrupt Set Command Register*/
	AT91_REG	 AIC_EOICR; 	/* End of Interrupt Command Register*/
	AT91_REG	 AIC_SPU; 	/* Spurious Vector Register*/
	AT91_REG	 AIC_DCR; 	/* Debug Control Register (Protect)*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 AIC_FFER; 	/* Fast Forcing Enable Register*/
	AT91_REG	 AIC_FFDR; 	/* Fast Forcing Disable Register*/
	AT91_REG	 AIC_FFSR; 	/* Fast Forcing Status Register*/
	AT91_REG	 Reserved2[45]; 	/* */
	AT91_REG	 DBGU_CR; 	/* Control Register*/
	AT91_REG	 DBGU_MR; 	/* Mode Register*/
	AT91_REG	 DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved3[7]; 	/* */
	AT91_REG	 DBGU_CIDR; 	/* Chip ID Register*/
	AT91_REG	 DBGU_EXID; 	/* Chip ID Extension Register*/
	AT91_REG	 DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved4[45]; 	/* */
	AT91_REG	 DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 DBGU_PTSR; 	/* PDC Transfer Status Register*/
	AT91_REG	 Reserved5[54]; 	/* */
	AT91_REG	 PIOA_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOA_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOA_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved6[1]; 	/* */
	AT91_REG	 PIOA_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOA_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOA_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved7[1]; 	/* */
	AT91_REG	 PIOA_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOA_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOA_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved8[1]; 	/* */
	AT91_REG	 PIOA_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOA_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOA_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOA_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOA_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOA_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOA_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOA_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOA_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOA_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOA_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved9[1]; 	/* */
	AT91_REG	 PIOA_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOA_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOA_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved10[1]; 	/* */
	AT91_REG	 PIOA_ASR; 	/* Select A Register*/
	AT91_REG	 PIOA_BSR; 	/* Select B Register*/
	AT91_REG	 PIOA_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved11[9]; 	/* */
	AT91_REG	 PIOA_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOA_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOA_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved12[85]; 	/* */
	AT91_REG	 PIOB_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOB_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOB_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved13[1]; 	/* */
	AT91_REG	 PIOB_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOB_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOB_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved14[1]; 	/* */
	AT91_REG	 PIOB_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOB_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOB_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved15[1]; 	/* */
	AT91_REG	 PIOB_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOB_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOB_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOB_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOB_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOB_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOB_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOB_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOB_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOB_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOB_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved16[1]; 	/* */
	AT91_REG	 PIOB_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOB_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOB_PPUSR; 	/* Pull-up Status Register*/
	AT91_REG	 Reserved17[1]; 	/* */
	AT91_REG	 PIOB_ASR; 	/* Select A Register*/
	AT91_REG	 PIOB_BSR; 	/* Select B Register*/
	AT91_REG	 PIOB_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved18[9]; 	/* */
	AT91_REG	 PIOB_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOB_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOB_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved19[341]; 	/* */
	AT91_REG	 PMC_SCER; 	/* System Clock Enable Register*/
	AT91_REG	 PMC_SCDR; 	/* System Clock Disable Register*/
	AT91_REG	 PMC_SCSR; 	/* System Clock Status Register*/
	AT91_REG	 Reserved20[1]; 	/* */
	AT91_REG	 PMC_PCER; 	/* Peripheral Clock Enable Register*/
	AT91_REG	 PMC_PCDR; 	/* Peripheral Clock Disable Register*/
	AT91_REG	 PMC_PCSR; 	/* Peripheral Clock Status Register*/
	AT91_REG	 Reserved21[1]; 	/* */
	AT91_REG	 PMC_MOR; 	/* Main Oscillator Register*/
	AT91_REG	 PMC_MCFR; 	/* Main Clock  Frequency Register*/
	AT91_REG	 Reserved22[1]; 	/* */
	AT91_REG	 PMC_PLLR; 	/* PLL Register*/
	AT91_REG	 PMC_MCKR; 	/* Master Clock Register*/
	AT91_REG	 Reserved23[3]; 	/* */
	AT91_REG	 PMC_PCKR[4]; 	/* Programmable Clock Register*/
	AT91_REG	 Reserved24[4]; 	/* */
	AT91_REG	 PMC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PMC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PMC_SR; 	/* Status Register*/
	AT91_REG	 PMC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved25[36]; 	/* */
	AT91_REG	 RSTC_RCR; 	/* Reset Control Register*/
	AT91_REG	 RSTC_RSR; 	/* Reset Status Register*/
	AT91_REG	 RSTC_RMR; 	/* Reset Mode Register*/
	AT91_REG	 Reserved26[5]; 	/* */
	AT91_REG	 RTTC_RTMR; 	/* Real-time Mode Register*/
	AT91_REG	 RTTC_RTAR; 	/* Real-time Alarm Register*/
	AT91_REG	 RTTC_RTVR; 	/* Real-time Value Register*/
	AT91_REG	 RTTC_RTSR; 	/* Real-time Status Register*/
	AT91_REG	 PITC_PIMR; 	/* Period Interval Mode Register*/
	AT91_REG	 PITC_PISR; 	/* Period Interval Status Register*/
	AT91_REG	 PITC_PIVR; 	/* Period Interval Value Register*/
	AT91_REG	 PITC_PIIR; 	/* Period Interval Image Register*/
	AT91_REG	 WDTC_WDCR; 	/* Watchdog Control Register*/
	AT91_REG	 WDTC_WDMR; 	/* Watchdog Mode Register*/
	AT91_REG	 WDTC_WDSR; 	/* Watchdog Status Register*/
	AT91_REG	 Reserved27[5]; 	/* */
	AT91_REG	 VREG_MR; 	/* Voltage Regulator Mode Register*/
} AT91S_SYS, *AT91PS_SYS;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Advanced Interrupt Controller*/
/* ******************************************************************************/
typedef struct _AT91S_AIC {
	AT91_REG	 AIC_SMR[32]; 	/* Source Mode Register*/
	AT91_REG	 AIC_SVR[32]; 	/* Source Vector Register*/
	AT91_REG	 AIC_IVR; 	/* IRQ Vector Register*/
	AT91_REG	 AIC_FVR; 	/* FIQ Vector Register*/
	AT91_REG	 AIC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 AIC_IPR; 	/* Interrupt Pending Register*/
	AT91_REG	 AIC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 AIC_CISR; 	/* Core Interrupt Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AIC_IECR; 	/* Interrupt Enable Command Register*/
	AT91_REG	 AIC_IDCR; 	/* Interrupt Disable Command Register*/
	AT91_REG	 AIC_ICCR; 	/* Interrupt Clear Command Register*/
	AT91_REG	 AIC_ISCR; 	/* Interrupt Set Command Register*/
	AT91_REG	 AIC_EOICR; 	/* End of Interrupt Command Register*/
	AT91_REG	 AIC_SPU; 	/* Spurious Vector Register*/
	AT91_REG	 AIC_DCR; 	/* Debug Control Register (Protect)*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 AIC_FFER; 	/* Fast Forcing Enable Register*/
	AT91_REG	 AIC_FFDR; 	/* Fast Forcing Disable Register*/
	AT91_REG	 AIC_FFSR; 	/* Fast Forcing Status Register*/
} AT91S_AIC, *AT91PS_AIC;

/* -------- AIC_SMR : (AIC Offset: 0x0) Control Register -------- */
#define AT91C_AIC_PRIOR       ((unsigned int) 0x7 <<  0) /* (AIC) Priority Level*/
#define 	AT91C_AIC_PRIOR_LOWEST               ((unsigned int) 0x0) /* (AIC) Lowest priority level*/
#define 	AT91C_AIC_PRIOR_HIGHEST              ((unsigned int) 0x7) /* (AIC) Highest priority level*/
#define AT91C_AIC_SRCTYPE     ((unsigned int) 0x3 <<  5) /* (AIC) Interrupt Source Type*/
#define 	AT91C_AIC_SRCTYPE_EXT_LOW_LEVEL        ((unsigned int) 0x0 <<  5) /* (AIC) External Sources Code Label Low-level Sensitive*/
#define 	AT91C_AIC_SRCTYPE_INT_HIGH_LEVEL       ((unsigned int) 0x0 <<  5) /* (AIC) Internal Sources Code Label High-level Sensitive*/
#define 	AT91C_AIC_SRCTYPE_INT_POSITIVE_EDGE    ((unsigned int) 0x1 <<  5) /* (AIC) Internal Sources Code Label Positive Edge triggered*/
#define 	AT91C_AIC_SRCTYPE_EXT_NEGATIVE_EDGE    ((unsigned int) 0x1 <<  5) /* (AIC) External Sources Code Label Negative Edge triggered*/
#define 	AT91C_AIC_SRCTYPE_HIGH_LEVEL           ((unsigned int) 0x2 <<  5) /* (AIC) Internal Or External Sources Code Label High-level Sensitive*/
#define 	AT91C_AIC_SRCTYPE_POSITIVE_EDGE        ((unsigned int) 0x3 <<  5) /* (AIC) Internal Or External Sources Code Label Positive Edge triggered*/
/* -------- AIC_CISR : (AIC Offset: 0x114) AIC Core Interrupt Status Register -------- */
#define AT91C_AIC_NFIQ        ((unsigned int) 0x1 <<  0) /* (AIC) NFIQ Status*/
#define AT91C_AIC_NIRQ        ((unsigned int) 0x1 <<  1) /* (AIC) NIRQ Status*/
/* -------- AIC_DCR : (AIC Offset: 0x138) AIC Debug Control Register (Protect) -------- */
#define AT91C_AIC_DCR_PROT    ((unsigned int) 0x1 <<  0) /* (AIC) Protection Mode*/
#define AT91C_AIC_DCR_GMSK    ((unsigned int) 0x1 <<  1) /* (AIC) General Mask*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Peripheral DMA Controller*/
/* ******************************************************************************/
typedef struct _AT91S_PDC {
	AT91_REG	 PDC_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 PDC_RCR; 	/* Receive Counter Register*/
	AT91_REG	 PDC_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 PDC_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 PDC_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 PDC_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 PDC_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 PDC_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 PDC_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 PDC_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_PDC, *AT91PS_PDC;

/* -------- PDC_PTCR : (PDC Offset: 0x20) PDC Transfer Control Register -------- */
#define AT91C_PDC_RXTEN       ((unsigned int) 0x1 <<  0) /* (PDC) Receiver Transfer Enable*/
#define AT91C_PDC_RXTDIS      ((unsigned int) 0x1 <<  1) /* (PDC) Receiver Transfer Disable*/
#define AT91C_PDC_TXTEN       ((unsigned int) 0x1 <<  8) /* (PDC) Transmitter Transfer Enable*/
#define AT91C_PDC_TXTDIS      ((unsigned int) 0x1 <<  9) /* (PDC) Transmitter Transfer Disable*/
/* -------- PDC_PTSR : (PDC Offset: 0x24) PDC Transfer Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Debug Unit*/
/* ******************************************************************************/
typedef struct _AT91S_DBGU {
	AT91_REG	 DBGU_CR; 	/* Control Register*/
	AT91_REG	 DBGU_MR; 	/* Mode Register*/
	AT91_REG	 DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved0[7]; 	/* */
	AT91_REG	 DBGU_CIDR; 	/* Chip ID Register*/
	AT91_REG	 DBGU_EXID; 	/* Chip ID Extension Register*/
	AT91_REG	 DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved1[45]; 	/* */
	AT91_REG	 DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 DBGU_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_DBGU, *AT91PS_DBGU;

