una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7x512.h
/* -------- RTTC_RTMR : (RTTC Offset: 0x0) Real-time Mode Register -------- */
#define AT91C_RTTC_RTPRES     ((unsigned int) 0xFFFF <<  0) /* (RTTC) Real-time Timer Prescaler Value*/
#define AT91C_RTTC_ALMIEN     ((unsigned int) 0x1 << 16) /* (RTTC) Alarm Interrupt Enable*/
#define AT91C_RTTC_RTTINCIEN  ((unsigned int) 0x1 << 17) /* (RTTC) Real Time Timer Increment Interrupt Enable*/
#define AT91C_RTTC_RTTRST     ((unsigned int) 0x1 << 18) /* (RTTC) Real Time Timer Restart*/
/* -------- RTTC_RTAR : (RTTC Offset: 0x4) Real-time Alarm Register -------- */
#define AT91C_RTTC_ALMV       ((unsigned int) 0x0 <<  0) /* (RTTC) Alarm Value*/
/* -------- RTTC_RTVR : (RTTC Offset: 0x8) Current Real-time Value Register -------- */
#define AT91C_RTTC_CRTV       ((unsigned int) 0x0 <<  0) /* (RTTC) Current Real-time Value*/
/* -------- RTTC_RTSR : (RTTC Offset: 0xc) Real-time Status Register -------- */
#define AT91C_RTTC_ALMS       ((unsigned int) 0x1 <<  0) /* (RTTC) Real-time Alarm Status*/
#define AT91C_RTTC_RTTINC     ((unsigned int) 0x1 <<  1) /* (RTTC) Real-time Timer Increment*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Periodic Interval Timer Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_PITC {
	AT91_REG	 PITC_PIMR; 	/* Period Interval Mode Register*/
	AT91_REG	 PITC_PISR; 	/* Period Interval Status Register*/
	AT91_REG	 PITC_PIVR; 	/* Period Interval Value Register*/
	AT91_REG	 PITC_PIIR; 	/* Period Interval Image Register*/
} AT91S_PITC, *AT91PS_PITC;

/* -------- PITC_PIMR : (PITC Offset: 0x0) Periodic Interval Mode Register -------- */
#define AT91C_PITC_PIV        ((unsigned int) 0xFFFFF <<  0) /* (PITC) Periodic Interval Value*/
#define AT91C_PITC_PITEN      ((unsigned int) 0x1 << 24) /* (PITC) Periodic Interval Timer Enabled*/
#define AT91C_PITC_PITIEN     ((unsigned int) 0x1 << 25) /* (PITC) Periodic Interval Timer Interrupt Enable*/
/* -------- PITC_PISR : (PITC Offset: 0x4) Periodic Interval Status Register -------- */
#define AT91C_PITC_PITS       ((unsigned int) 0x1 <<  0) /* (PITC) Periodic Interval Timer Status*/
/* -------- PITC_PIVR : (PITC Offset: 0x8) Periodic Interval Value Register -------- */
#define AT91C_PITC_CPIV       ((unsigned int) 0xFFFFF <<  0) /* (PITC) Current Periodic Interval Value*/
#define AT91C_PITC_PICNT      ((unsigned int) 0xFFF << 20) /* (PITC) Periodic Interval Counter*/
/* -------- PITC_PIIR : (PITC Offset: 0xc) Periodic Interval Image Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Watchdog Timer Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_WDTC {
	AT91_REG	 WDTC_WDCR; 	/* Watchdog Control Register*/
	AT91_REG	 WDTC_WDMR; 	/* Watchdog Mode Register*/
	AT91_REG	 WDTC_WDSR; 	/* Watchdog Status Register*/
} AT91S_WDTC, *AT91PS_WDTC;

/* -------- WDTC_WDCR : (WDTC Offset: 0x0) Periodic Interval Image Register -------- */
#define AT91C_WDTC_WDRSTT     ((unsigned int) 0x1 <<  0) /* (WDTC) Watchdog Restart*/
#define AT91C_WDTC_KEY        ((unsigned int) 0xFF << 24) /* (WDTC) Watchdog KEY Password*/
/* -------- WDTC_WDMR : (WDTC Offset: 0x4) Watchdog Mode Register -------- */
#define AT91C_WDTC_WDV        ((unsigned int) 0xFFF <<  0) /* (WDTC) Watchdog Timer Restart*/
#define AT91C_WDTC_WDFIEN     ((unsigned int) 0x1 << 12) /* (WDTC) Watchdog Fault Interrupt Enable*/
#define AT91C_WDTC_WDRSTEN    ((unsigned int) 0x1 << 13) /* (WDTC) Watchdog Reset Enable*/
#define AT91C_WDTC_WDRPROC    ((unsigned int) 0x1 << 14) /* (WDTC) Watchdog Timer Restart*/
#define AT91C_WDTC_WDDIS      ((unsigned int) 0x1 << 15) /* (WDTC) Watchdog Disable*/
#define AT91C_WDTC_WDD        ((unsigned int) 0xFFF << 16) /* (WDTC) Watchdog Delta Value*/
#define AT91C_WDTC_WDDBGHLT   ((unsigned int) 0x1 << 28) /* (WDTC) Watchdog Debug Halt*/
#define AT91C_WDTC_WDIDLEHLT  ((unsigned int) 0x1 << 29) /* (WDTC) Watchdog Idle Halt*/
/* -------- WDTC_WDSR : (WDTC Offset: 0x8) Watchdog Status Register -------- */
#define AT91C_WDTC_WDUNF      ((unsigned int) 0x1 <<  0) /* (WDTC) Watchdog Underflow*/
#define AT91C_WDTC_WDERR      ((unsigned int) 0x1 <<  1) /* (WDTC) Watchdog Error*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Voltage Regulator Mode Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_VREG {
	AT91_REG	 VREG_MR; 	/* Voltage Regulator Mode Register*/
} AT91S_VREG, *AT91PS_VREG;

/* -------- VREG_MR : (VREG Offset: 0x0) Voltage Regulator Mode Register -------- */
#define AT91C_VREG_PSTDBY     ((unsigned int) 0x1 <<  0) /* (VREG) Voltage Regulator Power Standby Mode*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Embedded Flash Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_EFC {
	AT91_REG	 EFC_FMR; 	/* MC Flash Mode Register*/
	AT91_REG	 EFC_FCR; 	/* MC Flash Command Register*/
	AT91_REG	 EFC_FSR; 	/* MC Flash Status Register*/
	AT91_REG	 EFC_VR; 	/* MC Flash Version Register*/
} AT91S_EFC, *AT91PS_EFC;

/* -------- MC_FMR : (EFC Offset: 0x0) MC Flash Mode Register -------- */
#define AT91C_MC_FRDY         ((unsigned int) 0x1 <<  0) /* (EFC) Flash Ready*/
#define AT91C_MC_LOCKE        ((unsigned int) 0x1 <<  2) /* (EFC) Lock Error*/
#define AT91C_MC_PROGE        ((unsigned int) 0x1 <<  3) /* (EFC) Programming Error*/
#define AT91C_MC_NEBP         ((unsigned int) 0x1 <<  7) /* (EFC) No Erase Before Programming*/
#define AT91C_MC_FWS          ((unsigned int) 0x3 <<  8) /* (EFC) Flash Wait State*/
#define 	AT91C_MC_FWS_0FWS                 ((unsigned int) 0x0 <<  8) /* (EFC) 1 cycle for Read, 2 for Write operations*/
#define 	AT91C_MC_FWS_1FWS                 ((unsigned int) 0x1 <<  8) /* (EFC) 2 cycles for Read, 3 for Write operations*/
#define 	AT91C_MC_FWS_2FWS                 ((unsigned int) 0x2 <<  8) /* (EFC) 3 cycles for Read, 4 for Write operations*/
#define 	AT91C_MC_FWS_3FWS                 ((unsigned int) 0x3 <<  8) /* (EFC) 4 cycles for Read, 4 for Write operations*/
#define AT91C_MC_FMCN         ((unsigned int) 0xFF << 16) /* (EFC) Flash Microsecond Cycle Number*/
/* -------- MC_FCR : (EFC Offset: 0x4) MC Flash Command Register -------- */
#define AT91C_MC_FCMD         ((unsigned int) 0xF <<  0) /* (EFC) Flash Command*/
#define 	AT91C_MC_FCMD_START_PROG           ((unsigned int) 0x1) /* (EFC) Starts the programming of th epage specified by PAGEN.*/
#define 	AT91C_MC_FCMD_LOCK                 ((unsigned int) 0x2) /* (EFC) Starts a lock sequence of the sector defined by the bits 4 to 7 of the field PAGEN.*/
#define 	AT91C_MC_FCMD_PROG_AND_LOCK        ((unsigned int) 0x3) /* (EFC) The lock sequence automatically happens after the programming sequence is completed.*/
#define 	AT91C_MC_FCMD_UNLOCK               ((unsigned int) 0x4) /* (EFC) Starts an unlock sequence of the sector defined by the bits 4 to 7 of the field PAGEN.*/
#define 	AT91C_MC_FCMD_ERASE_ALL            ((unsigned int) 0x8) /* (EFC) Starts the erase of the entire flash.If at least a page is locked, the command is cancelled.*/
#define 	AT91C_MC_FCMD_SET_GP_NVM           ((unsigned int) 0xB) /* (EFC) Set General Purpose NVM bits.*/
#define 	AT91C_MC_FCMD_CLR_GP_NVM           ((unsigned int) 0xD) /* (EFC) Clear General Purpose NVM bits.*/
#define 	AT91C_MC_FCMD_SET_SECURITY         ((unsigned int) 0xF) /* (EFC) Set Security Bit.*/
#define AT91C_MC_PAGEN        ((unsigned int) 0x3FF <<  8) /* (EFC) Page Number*/
#define AT91C_MC_KEY          ((unsigned int) 0xFF << 24) /* (EFC) Writing Protect Key*/
/* -------- MC_FSR : (EFC Offset: 0x8) MC Flash Command Register -------- */
#define AT91C_MC_SECURITY     ((unsigned int) 0x1 <<  4) /* (EFC) Security Bit Status*/
#define AT91C_MC_GPNVM0       ((unsigned int) 0x1 <<  8) /* (EFC) Sector 0 Lock Status*/
#define AT91C_MC_GPNVM1       ((unsigned int) 0x1 <<  9) /* (EFC) Sector 1 Lock Status*/
#define AT91C_MC_GPNVM2       ((unsigned int) 0x1 << 10) /* (EFC) Sector 2 Lock Status*/
#define AT91C_MC_GPNVM3       ((unsigned int) 0x1 << 11) /* (EFC) Sector 3 Lock Status*/
#define AT91C_MC_GPNVM4       ((unsigned int) 0x1 << 12) /* (EFC) Sector 4 Lock Status*/
#define AT91C_MC_GPNVM5       ((unsigned int) 0x1 << 13) /* (EFC) Sector 5 Lock Status*/
#define AT91C_MC_GPNVM6       ((unsigned int) 0x1 << 14) /* (EFC) Sector 6 Lock Status*/
#define AT91C_MC_GPNVM7       ((unsigned int) 0x1 << 15) /* (EFC) Sector 7 Lock Status*/
#define AT91C_MC_LOCKS0       ((unsigned int) 0x1 << 16) /* (EFC) Sector 0 Lock Status*/
#define AT91C_MC_LOCKS1       ((unsigned int) 0x1 << 17) /* (EFC) Sector 1 Lock Status*/
#define AT91C_MC_LOCKS2       ((unsigned int) 0x1 << 18) /* (EFC) Sector 2 Lock Status*/
#define AT91C_MC_LOCKS3       ((unsigned int) 0x1 << 19) /* (EFC) Sector 3 Lock Status*/
#define AT91C_MC_LOCKS4       ((unsigned int) 0x1 << 20) /* (EFC) Sector 4 Lock Status*/
#define AT91C_MC_LOCKS5       ((unsigned int) 0x1 << 21) /* (EFC) Sector 5 Lock Status*/
#define AT91C_MC_LOCKS6       ((unsigned int) 0x1 << 22) /* (EFC) Sector 6 Lock Status*/
#define AT91C_MC_LOCKS7       ((unsigned int) 0x1 << 23) /* (EFC) Sector 7 Lock Status*/
#define AT91C_MC_LOCKS8       ((unsigned int) 0x1 << 24) /* (EFC) Sector 8 Lock Status*/
#define AT91C_MC_LOCKS9       ((unsigned int) 0x1 << 25) /* (EFC) Sector 9 Lock Status*/
#define AT91C_MC_LOCKS10      ((unsigned int) 0x1 << 26) /* (EFC) Sector 10 Lock Status*/
#define AT91C_MC_LOCKS11      ((unsigned int) 0x1 << 27) /* (EFC) Sector 11 Lock Status*/
#define AT91C_MC_LOCKS12      ((unsigned int) 0x1 << 28) /* (EFC) Sector 12 Lock Status*/
#define AT91C_MC_LOCKS13      ((unsigned int) 0x1 << 29) /* (EFC) Sector 13 Lock Status*/
#define AT91C_MC_LOCKS14      ((unsigned int) 0x1 << 30) /* (EFC) Sector 14 Lock Status*/
#define AT91C_MC_LOCKS15      ((unsigned int) 0x1 << 31) /* (EFC) Sector 15 Lock Status*/
/* -------- EFC_VR : (EFC Offset: 0xc) EFC version register -------- */
#define AT91C_EFC_VERSION     ((unsigned int) 0xFFF <<  0) /* (EFC) EFC version number*/
#define AT91C_EFC_MFN         ((unsigned int) 0x7 << 16) /* (EFC) EFC MFN*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Memory Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_MC {
	AT91_REG	 MC_RCR; 	/* MC Remap Control Register*/
	AT91_REG	 MC_ASR; 	/* MC Abort Status Register*/
	AT91_REG	 MC_AASR; 	/* MC Abort Address Status Register*/
	AT91_REG	 Reserved0[21]; 	/* */
	AT91_REG	 MC_FMR; 	/* MC Flash Mode Register*/
	AT91_REG	 MC_FCR; 	/* MC Flash Command Register*/
	AT91_REG	 MC_FSR; 	/* MC Flash Status Register*/
} AT91S_MC, *AT91PS_MC;

/* -------- MC_RCR : (MC Offset: 0x0) MC Remap Control Register -------- */
#define AT91C_MC_RCB          ((unsigned int) 0x1 <<  0) /* (MC) Remap Command Bit*/
/* -------- MC_ASR : (MC Offset: 0x4) MC Abort Status Register -------- */
#define AT91C_MC_UNDADD       ((unsigned int) 0x1 <<  0) /* (MC) Undefined Addess Abort Status*/
#define AT91C_MC_MISADD       ((unsigned int) 0x1 <<  1) /* (MC) Misaligned Addess Abort Status*/
#define AT91C_MC_ABTSZ        ((unsigned int) 0x3 <<  8) /* (MC) Abort Size Status*/
#define 	AT91C_MC_ABTSZ_BYTE                 ((unsigned int) 0x0 <<  8) /* (MC) Byte*/
#define 	AT91C_MC_ABTSZ_HWORD                ((unsigned int) 0x1 <<  8) /* (MC) Half-word*/
#define 	AT91C_MC_ABTSZ_WORD                 ((unsigned int) 0x2 <<  8) /* (MC) Word*/
#define AT91C_MC_ABTTYP       ((unsigned int) 0x3 << 10) /* (MC) Abort Type Status*/
#define 	AT91C_MC_ABTTYP_DATAR                ((unsigned int) 0x0 << 10) /* (MC) Data Read*/
#define 	AT91C_MC_ABTTYP_DATAW                ((unsigned int) 0x1 << 10) /* (MC) Data Write*/
#define 	AT91C_MC_ABTTYP_FETCH                ((unsigned int) 0x2 << 10) /* (MC) Code Fetch*/
#define AT91C_MC_MST0         ((unsigned int) 0x1 << 16) /* (MC) Master 0 Abort Source*/
#define AT91C_MC_MST1         ((unsigned int) 0x1 << 17) /* (MC) Master 1 Abort Source*/
#define AT91C_MC_SVMST0       ((unsigned int) 0x1 << 24) /* (MC) Saved Master 0 Abort Source*/
#define AT91C_MC_SVMST1       ((unsigned int) 0x1 << 25) /* (MC) Saved Master 1 Abort Source*/
/* -------- MC_FMR : (MC Offset: 0x60) MC Flash Mode Register -------- */
/* -------- MC_FCR : (MC Offset: 0x64) MC Flash Command Register -------- */
/* -------- MC_FSR : (MC Offset: 0x68) MC Flash Command Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Serial Parallel Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SPI {
	AT91_REG	 SPI_CR; 	/* Control Register*/
	AT91_REG	 SPI_MR; 	/* Mode Register*/
	AT91_REG	 SPI_RDR; 	/* Receive Data Register*/
	AT91_REG	 SPI_TDR; 	/* Transmit Data Register*/
	AT91_REG	 SPI_SR; 	/* Status Register*/
	AT91_REG	 SPI_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 SPI_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 SPI_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved0[4]; 	/* */
	AT91_REG	 SPI_CSR[4]; 	/* Chip Select Register*/
	AT91_REG	 Reserved1[48]; 	/* */
	AT91_REG	 SPI_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 SPI_RCR; 	/* Receive Counter Register*/
	AT91_REG	 SPI_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 SPI_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 SPI_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 SPI_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 SPI_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 SPI_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 SPI_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 SPI_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_SPI, *AT91PS_SPI;

