una1veritas/Workspace/ARM_STM32/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7x512.h
#define AT91C_SSC_CMR   ((AT91_REG *) 	0xFFFD4004) /* (SSC) Clock Mode Register*/
#define AT91C_SSC_IDR   ((AT91_REG *) 	0xFFFD4048) /* (SSC) Interrupt Disable Register*/
#define AT91C_SSC_SR    ((AT91_REG *) 	0xFFFD4040) /* (SSC) Status Register*/
#define AT91C_SSC_RSHR  ((AT91_REG *) 	0xFFFD4030) /* (SSC) Receive Sync Holding Register*/
#define AT91C_SSC_RHR   ((AT91_REG *) 	0xFFFD4020) /* (SSC) Receive Holding Register*/
#define AT91C_SSC_TCMR  ((AT91_REG *) 	0xFFFD4018) /* (SSC) Transmit Clock Mode Register*/
#define AT91C_SSC_RCMR  ((AT91_REG *) 	0xFFFD4010) /* (SSC) Receive Clock ModeRegister*/
#define AT91C_SSC_CR    ((AT91_REG *) 	0xFFFD4000) /* (SSC) Control Register*/
#define AT91C_SSC_IMR   ((AT91_REG *) 	0xFFFD404C) /* (SSC) Interrupt Mask Register*/
#define AT91C_SSC_IER   ((AT91_REG *) 	0xFFFD4044) /* (SSC) Interrupt Enable Register*/
#define AT91C_SSC_TSHR  ((AT91_REG *) 	0xFFFD4034) /* (SSC) Transmit Sync Holding Register*/
#define AT91C_SSC_THR   ((AT91_REG *) 	0xFFFD4024) /* (SSC) Transmit Holding Register*/
#define AT91C_SSC_TFMR  ((AT91_REG *) 	0xFFFD401C) /* (SSC) Transmit Frame Mode Register*/
/* ========== Register definition for TWI peripheral ========== */
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFFB8030) /* (TWI) Receive Holding Register*/
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFFB8028) /* (TWI) Interrupt Disable Register*/
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFFB8020) /* (TWI) Status Register*/
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFFB8010) /* (TWI) Clock Waveform Generator Register*/
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFFB8000) /* (TWI) Control Register*/
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFFB8034) /* (TWI) Transmit Holding Register*/
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFFB802C) /* (TWI) Interrupt Mask Register*/
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFFB8024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFFB800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFFB8004) /* (TWI) Master Mode Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
#define AT91C_PWMC_CH3_CUPDR ((AT91_REG *) 	0xFFFCC270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_PWMC_CH3_CPRDR ((AT91_REG *) 	0xFFFCC268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_PWMC_CH3_CMR ((AT91_REG *) 	0xFFFCC260) /* (PWMC_CH3) Channel Mode Register*/
#define AT91C_PWMC_CH3_Reserved ((AT91_REG *) 	0xFFFCC274) /* (PWMC_CH3) Reserved*/
#define AT91C_PWMC_CH3_CCNTR ((AT91_REG *) 	0xFFFCC26C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_PWMC_CH3_CDTYR ((AT91_REG *) 	0xFFFCC264) /* (PWMC_CH3) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_PWMC_CH2_CUPDR ((AT91_REG *) 	0xFFFCC250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_PWMC_CH2_CPRDR ((AT91_REG *) 	0xFFFCC248) /* (PWMC_CH2) Channel Period Register*/
#define AT91C_PWMC_CH2_CMR ((AT91_REG *) 	0xFFFCC240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_PWMC_CH2_Reserved ((AT91_REG *) 	0xFFFCC254) /* (PWMC_CH2) Reserved*/
#define AT91C_PWMC_CH2_CCNTR ((AT91_REG *) 	0xFFFCC24C) /* (PWMC_CH2) Channel Counter Register*/
#define AT91C_PWMC_CH2_CDTYR ((AT91_REG *) 	0xFFFCC244) /* (PWMC_CH2) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_PWMC_CH1_CUPDR ((AT91_REG *) 	0xFFFCC230) /* (PWMC_CH1) Channel Update Register*/
#define AT91C_PWMC_CH1_CPRDR ((AT91_REG *) 	0xFFFCC228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_PWMC_CH1_CMR ((AT91_REG *) 	0xFFFCC220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_PWMC_CH1_Reserved ((AT91_REG *) 	0xFFFCC234) /* (PWMC_CH1) Reserved*/
#define AT91C_PWMC_CH1_CCNTR ((AT91_REG *) 	0xFFFCC22C) /* (PWMC_CH1) Channel Counter Register*/
#define AT91C_PWMC_CH1_CDTYR ((AT91_REG *) 	0xFFFCC224) /* (PWMC_CH1) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_PWMC_CH0_CUPDR ((AT91_REG *) 	0xFFFCC210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_PWMC_CH0_CPRDR ((AT91_REG *) 	0xFFFCC208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_PWMC_CH0_CMR ((AT91_REG *) 	0xFFFCC200) /* (PWMC_CH0) Channel Mode Register*/
#define AT91C_PWMC_CH0_Reserved ((AT91_REG *) 	0xFFFCC214) /* (PWMC_CH0) Reserved*/
#define AT91C_PWMC_CH0_CCNTR ((AT91_REG *) 	0xFFFCC20C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_PWMC_CH0_CDTYR ((AT91_REG *) 	0xFFFCC204) /* (PWMC_CH0) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFCC0FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFCC01C) /* (PWMC) PWMC Interrupt Status Register*/
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFCC014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFCC00C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFCC004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFCC018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFCC000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFCC008) /* (PWMC) PWMC Disable Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFCC010) /* (PWMC) PWMC Interrupt Enable Register*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFFB0074) /* (UDP) Transceiver Control Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFFB001C) /* (UDP) Interrupt Status Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFFB0014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFFB0030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFFB0028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFFB0020) /* (UDP) Interrupt Clear Register*/
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFFB0004) /* (UDP) Global State Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFFB0000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFFB0008) /* (UDP) Function Address Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFFB0010) /* (UDP) Interrupt Enable Register*/
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFFB0018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFFB0050) /* (UDP) Endpoint FIFO Data Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) /* (TC0) Register C*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) /* (TC0) Register A*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) /* (TC0) Interrupt Disable Register*/
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) /* (TC0) Status Register*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) /* (TC0) Register B*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) /* (TC0) Counter Value*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) /* (TC0) Channel Control Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFFA006C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFFA0064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFFA005C) /* (TC1) Register C*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFFA0054) /* (TC1) Register A*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFFA0044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFFA0068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFFA0060) /* (TC1) Status Register*/
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) /* (TC1) Register B*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFFA0050) /* (TC1) Counter Value*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFFA0040) /* (TC1) Channel Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFFA00AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFFA00A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFFA009C) /* (TC2) Register C*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFFA0094) /* (TC2) Register A*/
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFFA0084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFFA00A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFFA00A0) /* (TC2) Status Register*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFFA0098) /* (TC2) Register B*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFFA0090) /* (TC2) Counter Value*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFFA0080) /* (TC2) Channel Control Register*/
/* ========== Register definition for TCB peripheral ========== */
#define AT91C_TCB_BMR   ((AT91_REG *) 	0xFFFA00C4) /* (TCB) TC Block Mode Register*/
#define AT91C_TCB_BCR   ((AT91_REG *) 	0xFFFA00C0) /* (TCB) TC Block Control Register*/
/* ========== Register definition for CAN_MB0 peripheral ========== */
#define AT91C_CAN_MB0_MCR ((AT91_REG *) 	0xFFFD021C) /* (CAN_MB0) MailBox Control Register*/
#define AT91C_CAN_MB0_MDL ((AT91_REG *) 	0xFFFD0214) /* (CAN_MB0) MailBox Data Low Register*/
#define AT91C_CAN_MB0_MFID ((AT91_REG *) 	0xFFFD020C) /* (CAN_MB0) MailBox Family ID Register*/
#define AT91C_CAN_MB0_MAM ((AT91_REG *) 	0xFFFD0204) /* (CAN_MB0) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB0_MDH ((AT91_REG *) 	0xFFFD0218) /* (CAN_MB0) MailBox Data High Register*/
#define AT91C_CAN_MB0_MSR ((AT91_REG *) 	0xFFFD0210) /* (CAN_MB0) MailBox Status Register*/
#define AT91C_CAN_MB0_MID ((AT91_REG *) 	0xFFFD0208) /* (CAN_MB0) MailBox ID Register*/
#define AT91C_CAN_MB0_MMR ((AT91_REG *) 	0xFFFD0200) /* (CAN_MB0) MailBox Mode Register*/
/* ========== Register definition for CAN_MB1 peripheral ========== */
#define AT91C_CAN_MB1_MCR ((AT91_REG *) 	0xFFFD023C) /* (CAN_MB1) MailBox Control Register*/
#define AT91C_CAN_MB1_MDL ((AT91_REG *) 	0xFFFD0234) /* (CAN_MB1) MailBox Data Low Register*/
#define AT91C_CAN_MB1_MFID ((AT91_REG *) 	0xFFFD022C) /* (CAN_MB1) MailBox Family ID Register*/
#define AT91C_CAN_MB1_MAM ((AT91_REG *) 	0xFFFD0224) /* (CAN_MB1) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB1_MDH ((AT91_REG *) 	0xFFFD0238) /* (CAN_MB1) MailBox Data High Register*/
#define AT91C_CAN_MB1_MSR ((AT91_REG *) 	0xFFFD0230) /* (CAN_MB1) MailBox Status Register*/
#define AT91C_CAN_MB1_MID ((AT91_REG *) 	0xFFFD0228) /* (CAN_MB1) MailBox ID Register*/
#define AT91C_CAN_MB1_MMR ((AT91_REG *) 	0xFFFD0220) /* (CAN_MB1) MailBox Mode Register*/
/* ========== Register definition for CAN_MB2 peripheral ========== */
#define AT91C_CAN_MB2_MCR ((AT91_REG *) 	0xFFFD025C) /* (CAN_MB2) MailBox Control Register*/
#define AT91C_CAN_MB2_MDL ((AT91_REG *) 	0xFFFD0254) /* (CAN_MB2) MailBox Data Low Register*/
#define AT91C_CAN_MB2_MFID ((AT91_REG *) 	0xFFFD024C) /* (CAN_MB2) MailBox Family ID Register*/
#define AT91C_CAN_MB2_MAM ((AT91_REG *) 	0xFFFD0244) /* (CAN_MB2) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB2_MDH ((AT91_REG *) 	0xFFFD0258) /* (CAN_MB2) MailBox Data High Register*/
#define AT91C_CAN_MB2_MSR ((AT91_REG *) 	0xFFFD0250) /* (CAN_MB2) MailBox Status Register*/
#define AT91C_CAN_MB2_MID ((AT91_REG *) 	0xFFFD0248) /* (CAN_MB2) MailBox ID Register*/
#define AT91C_CAN_MB2_MMR ((AT91_REG *) 	0xFFFD0240) /* (CAN_MB2) MailBox Mode Register*/
/* ========== Register definition for CAN_MB3 peripheral ========== */
#define AT91C_CAN_MB3_MCR ((AT91_REG *) 	0xFFFD027C) /* (CAN_MB3) MailBox Control Register*/
#define AT91C_CAN_MB3_MDL ((AT91_REG *) 	0xFFFD0274) /* (CAN_MB3) MailBox Data Low Register*/
#define AT91C_CAN_MB3_MFID ((AT91_REG *) 	0xFFFD026C) /* (CAN_MB3) MailBox Family ID Register*/
#define AT91C_CAN_MB3_MAM ((AT91_REG *) 	0xFFFD0264) /* (CAN_MB3) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB3_MDH ((AT91_REG *) 	0xFFFD0278) /* (CAN_MB3) MailBox Data High Register*/
#define AT91C_CAN_MB3_MSR ((AT91_REG *) 	0xFFFD0270) /* (CAN_MB3) MailBox Status Register*/
#define AT91C_CAN_MB3_MID ((AT91_REG *) 	0xFFFD0268) /* (CAN_MB3) MailBox ID Register*/
#define AT91C_CAN_MB3_MMR ((AT91_REG *) 	0xFFFD0260) /* (CAN_MB3) MailBox Mode Register*/
/* ========== Register definition for CAN_MB4 peripheral ========== */
#define AT91C_CAN_MB4_MCR ((AT91_REG *) 	0xFFFD029C) /* (CAN_MB4) MailBox Control Register*/
#define AT91C_CAN_MB4_MDL ((AT91_REG *) 	0xFFFD0294) /* (CAN_MB4) MailBox Data Low Register*/
#define AT91C_CAN_MB4_MFID ((AT91_REG *) 	0xFFFD028C) /* (CAN_MB4) MailBox Family ID Register*/
#define AT91C_CAN_MB4_MAM ((AT91_REG *) 	0xFFFD0284) /* (CAN_MB4) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB4_MDH ((AT91_REG *) 	0xFFFD0298) /* (CAN_MB4) MailBox Data High Register*/
#define AT91C_CAN_MB4_MSR ((AT91_REG *) 	0xFFFD0290) /* (CAN_MB4) MailBox Status Register*/
#define AT91C_CAN_MB4_MID ((AT91_REG *) 	0xFFFD0288) /* (CAN_MB4) MailBox ID Register*/
#define AT91C_CAN_MB4_MMR ((AT91_REG *) 	0xFFFD0280) /* (CAN_MB4) MailBox Mode Register*/
/* ========== Register definition for CAN_MB5 peripheral ========== */
#define AT91C_CAN_MB5_MCR ((AT91_REG *) 	0xFFFD02BC) /* (CAN_MB5) MailBox Control Register*/
#define AT91C_CAN_MB5_MDL ((AT91_REG *) 	0xFFFD02B4) /* (CAN_MB5) MailBox Data Low Register*/
#define AT91C_CAN_MB5_MFID ((AT91_REG *) 	0xFFFD02AC) /* (CAN_MB5) MailBox Family ID Register*/
#define AT91C_CAN_MB5_MAM ((AT91_REG *) 	0xFFFD02A4) /* (CAN_MB5) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB5_MDH ((AT91_REG *) 	0xFFFD02B8) /* (CAN_MB5) MailBox Data High Register*/
#define AT91C_CAN_MB5_MSR ((AT91_REG *) 	0xFFFD02B0) /* (CAN_MB5) MailBox Status Register*/
#define AT91C_CAN_MB5_MID ((AT91_REG *) 	0xFFFD02A8) /* (CAN_MB5) MailBox ID Register*/
#define AT91C_CAN_MB5_MMR ((AT91_REG *) 	0xFFFD02A0) /* (CAN_MB5) MailBox Mode Register*/
/* ========== Register definition for CAN_MB6 peripheral ========== */
#define AT91C_CAN_MB6_MAM ((AT91_REG *) 	0xFFFD02C4) /* (CAN_MB6) MailBox Acceptance Mask Register*/
#define AT91C_CAN_MB6_MDH ((AT91_REG *) 	0xFFFD02D8) /* (CAN_MB6) MailBox Data High Register*/
#define AT91C_CAN_MB6_MSR ((AT91_REG *) 	0xFFFD02D0) /* (CAN_MB6) MailBox Status Register*/
#define AT91C_CAN_MB6_MID ((AT91_REG *) 	0xFFFD02C8) /* (CAN_MB6) MailBox ID Register*/
#define AT91C_CAN_MB6_MMR ((AT91_REG *) 	0xFFFD02C0) /* (CAN_MB6) MailBox Mode Register*/
#define AT91C_CAN_MB6_MCR ((AT91_REG *) 	0xFFFD02DC) /* (CAN_MB6) MailBox Control Register*/
#define AT91C_CAN_MB6_MDL ((AT91_REG *) 	0xFFFD02D4) /* (CAN_MB6) MailBox Data Low Register*/
#define AT91C_CAN_MB6_MFID ((AT91_REG *) 	0xFFFD02CC) /* (CAN_MB6) MailBox Family ID Register*/
/* ========== Register definition for CAN_MB7 peripheral ========== */
#define AT91C_CAN_MB7_MDH ((AT91_REG *) 	0xFFFD02F8) /* (CAN_MB7) MailBox Data High Register*/
#define AT91C_CAN_MB7_MSR ((AT91_REG *) 	0xFFFD02F0) /* (CAN_MB7) MailBox Status Register*/
#define AT91C_CAN_MB7_MID ((AT91_REG *) 	0xFFFD02E8) /* (CAN_MB7) MailBox ID Register*/
#define AT91C_CAN_MB7_MMR ((AT91_REG *) 	0xFFFD02E0) /* (CAN_MB7) MailBox Mode Register*/
#define AT91C_CAN_MB7_MCR ((AT91_REG *) 	0xFFFD02FC) /* (CAN_MB7) MailBox Control Register*/
#define AT91C_CAN_MB7_MDL ((AT91_REG *) 	0xFFFD02F4) /* (CAN_MB7) MailBox Data Low Register*/
#define AT91C_CAN_MB7_MFID ((AT91_REG *) 	0xFFFD02EC) /* (CAN_MB7) MailBox Family ID Register*/
#define AT91C_CAN_MB7_MAM ((AT91_REG *) 	0xFFFD02E4) /* (CAN_MB7) MailBox Acceptance Mask Register*/
/* ========== Register definition for CAN peripheral ========== */
#define AT91C_CAN_IMR   ((AT91_REG *) 	0xFFFD000C) /* (CAN) Interrupt Mask Register*/
#define AT91C_CAN_IER   ((AT91_REG *) 	0xFFFD0004) /* (CAN) Interrupt Enable Register*/
#define AT91C_CAN_ECR   ((AT91_REG *) 	0xFFFD0020) /* (CAN) Error Counter Register*/
#define AT91C_CAN_TIM   ((AT91_REG *) 	0xFFFD0018) /* (CAN) Timer Register*/
#define AT91C_CAN_SR    ((AT91_REG *) 	0xFFFD0010) /* (CAN) Status Register*/
#define AT91C_CAN_IDR   ((AT91_REG *) 	0xFFFD0008) /* (CAN) Interrupt Disable Register*/
#define AT91C_CAN_MR    ((AT91_REG *) 	0xFFFD0000) /* (CAN) Mode Register*/
#define AT91C_CAN_BR    ((AT91_REG *) 	0xFFFD0014) /* (CAN) Baudrate Register*/
#define AT91C_CAN_TIMESTP ((AT91_REG *) 	0xFFFD001C) /* (CAN) Time Stamp Register*/
#define AT91C_CAN_TCR   ((AT91_REG *) 	0xFFFD0024) /* (CAN) Transfer Command Register*/
#define AT91C_CAN_ACR   ((AT91_REG *) 	0xFFFD0028) /* (CAN) Abort Command Register*/
#define AT91C_CAN_VR    ((AT91_REG *) 	0xFFFD00FC) /* (CAN) Version Register*/
/* ========== Register definition for EMAC peripheral ========== */
#define AT91C_EMAC_TID  ((AT91_REG *) 	0xFFFDC0B8) /* (EMAC) Type ID Checking Register*/
#define AT91C_EMAC_SA3L ((AT91_REG *) 	0xFFFDC0A8) /* (EMAC) Specific Address 3 Bottom, First 4 bytes*/
#define AT91C_EMAC_STE  ((AT91_REG *) 	0xFFFDC084) /* (EMAC) SQE Test Error Register*/
#define AT91C_EMAC_RSE  ((AT91_REG *) 	0xFFFDC074) /* (EMAC) Receive Symbol Errors Register*/
#define AT91C_EMAC_IDR  ((AT91_REG *) 	0xFFFDC02C) /* (EMAC) Interrupt Disable Register*/
#define AT91C_EMAC_TBQP ((AT91_REG *) 	0xFFFDC01C) /* (EMAC) Transmit Buffer Queue Pointer*/
#define AT91C_EMAC_TPQ  ((AT91_REG *) 	0xFFFDC0BC) /* (EMAC) Transmit Pause Quantum Register*/
#define AT91C_EMAC_SA1L ((AT91_REG *) 	0xFFFDC098) /* (EMAC) Specific Address 1 Bottom, First 4 bytes*/
#define AT91C_EMAC_RLE  ((AT91_REG *) 	0xFFFDC088) /* (EMAC) Receive Length Field Mismatch Register*/
#define AT91C_EMAC_IMR  ((AT91_REG *) 	0xFFFDC030) /* (EMAC) Interrupt Mask Register*/
#define AT91C_EMAC_SA1H ((AT91_REG *) 	0xFFFDC09C) /* (EMAC) Specific Address 1 Top, Last 2 bytes*/
#define AT91C_EMAC_PFR  ((AT91_REG *) 	0xFFFDC03C) /* (EMAC) Pause Frames received Register*/
#define AT91C_EMAC_FCSE ((AT91_REG *) 	0xFFFDC050) /* (EMAC) Frame Check Sequence Error Register*/
#define AT91C_EMAC_FTO  ((AT91_REG *) 	0xFFFDC040) /* (EMAC) Frames Transmitted OK Register*/
#define AT91C_EMAC_TUND ((AT91_REG *) 	0xFFFDC064) /* (EMAC) Transmit Underrun Error Register*/
#define AT91C_EMAC_ALE  ((AT91_REG *) 	0xFFFDC054) /* (EMAC) Alignment Error Register*/
#define AT91C_EMAC_SCF  ((AT91_REG *) 	0xFFFDC044) /* (EMAC) Single Collision Frame Register*/
#define AT91C_EMAC_SA3H ((AT91_REG *) 	0xFFFDC0AC) /* (EMAC) Specific Address 3 Top, Last 2 bytes*/
#define AT91C_EMAC_ELE  ((AT91_REG *) 	0xFFFDC078) /* (EMAC) Excessive Length Errors Register*/
#define AT91C_EMAC_CSE  ((AT91_REG *) 	0xFFFDC068) /* (EMAC) Carrier Sense Error Register*/
#define AT91C_EMAC_DTF  ((AT91_REG *) 	0xFFFDC058) /* (EMAC) Deferred Transmission Frame Register*/
#define AT91C_EMAC_RSR  ((AT91_REG *) 	0xFFFDC020) /* (EMAC) Receive Status Register*/
#define AT91C_EMAC_USRIO ((AT91_REG *) 	0xFFFDC0C0) /* (EMAC) USER Input/Output Register*/
#define AT91C_EMAC_SA4L ((AT91_REG *) 	0xFFFDC0B0) /* (EMAC) Specific Address 4 Bottom, First 4 bytes*/
#define AT91C_EMAC_RRE  ((AT91_REG *) 	0xFFFDC06C) /* (EMAC) Receive Ressource Error Register*/
#define AT91C_EMAC_RJA  ((AT91_REG *) 	0xFFFDC07C) /* (EMAC) Receive Jabbers Register*/
#define AT91C_EMAC_TPF  ((AT91_REG *) 	0xFFFDC08C) /* (EMAC) Transmitted Pause Frames Register*/
#define AT91C_EMAC_ISR  ((AT91_REG *) 	0xFFFDC024) /* (EMAC) Interrupt Status Register*/
#define AT91C_EMAC_MAN  ((AT91_REG *) 	0xFFFDC034) /* (EMAC) PHY Maintenance Register*/
#define AT91C_EMAC_WOL  ((AT91_REG *) 	0xFFFDC0C4) /* (EMAC) Wake On LAN Register*/
#define AT91C_EMAC_USF  ((AT91_REG *) 	0xFFFDC080) /* (EMAC) Undersize Frames Register*/
#define AT91C_EMAC_HRB  ((AT91_REG *) 	0xFFFDC090) /* (EMAC) Hash Address Bottom[31:0]*/
#define AT91C_EMAC_PTR  ((AT91_REG *) 	0xFFFDC038) /* (EMAC) Pause Time Register*/
#define AT91C_EMAC_HRT  ((AT91_REG *) 	0xFFFDC094) /* (EMAC) Hash Address Top[63:32]*/
#define AT91C_EMAC_REV  ((AT91_REG *) 	0xFFFDC0FC) /* (EMAC) Revision Register*/
#define AT91C_EMAC_MCF  ((AT91_REG *) 	0xFFFDC048) /* (EMAC) Multiple Collision Frame Register*/
#define AT91C_EMAC_SA2L ((AT91_REG *) 	0xFFFDC0A0) /* (EMAC) Specific Address 2 Bottom, First 4 bytes*/
#define AT91C_EMAC_NCR  ((AT91_REG *) 	0xFFFDC000) /* (EMAC) Network Control Register*/
#define AT91C_EMAC_FRO  ((AT91_REG *) 	0xFFFDC04C) /* (EMAC) Frames Received OK Register*/
#define AT91C_EMAC_LCOL ((AT91_REG *) 	0xFFFDC05C) /* (EMAC) Late Collision Register*/
#define AT91C_EMAC_SA4H ((AT91_REG *) 	0xFFFDC0B4) /* (EMAC) Specific Address 4 Top, Last 2 bytes*/
#define AT91C_EMAC_NCFGR ((AT91_REG *) 	0xFFFDC004) /* (EMAC) Network Configuration Register*/
#define AT91C_EMAC_TSR  ((AT91_REG *) 	0xFFFDC014) /* (EMAC) Transmit Status Register*/
#define AT91C_EMAC_SA2H ((AT91_REG *) 	0xFFFDC0A4) /* (EMAC) Specific Address 2 Top, Last 2 bytes*/
#define AT91C_EMAC_ECOL ((AT91_REG *) 	0xFFFDC060) /* (EMAC) Excessive Collision Register*/
#define AT91C_EMAC_ROV  ((AT91_REG *) 	0xFFFDC070) /* (EMAC) Receive Overrun Errors Register*/
#define AT91C_EMAC_NSR  ((AT91_REG *) 	0xFFFDC008) /* (EMAC) Network Status Register*/
#define AT91C_EMAC_RBQP ((AT91_REG *) 	0xFFFDC018) /* (EMAC) Receive Buffer Queue Pointer*/
#define AT91C_EMAC_IER  ((AT91_REG *) 	0xFFFDC028) /* (EMAC) Interrupt Enable Register*/
/* ========== Register definition for PDC_ADC peripheral ========== */
#define AT91C_ADC_PTCR  ((AT91_REG *) 	0xFFFD8120) /* (PDC_ADC) PDC Transfer Control Register*/
#define AT91C_ADC_TNPR  ((AT91_REG *) 	0xFFFD8118) /* (PDC_ADC) Transmit Next Pointer Register*/
#define AT91C_ADC_RNPR  ((AT91_REG *) 	0xFFFD8110) /* (PDC_ADC) Receive Next Pointer Register*/
#define AT91C_ADC_TPR   ((AT91_REG *) 	0xFFFD8108) /* (PDC_ADC) Transmit Pointer Register*/
#define AT91C_ADC_RPR   ((AT91_REG *) 	0xFFFD8100) /* (PDC_ADC) Receive Pointer Register*/
#define AT91C_ADC_PTSR  ((AT91_REG *) 	0xFFFD8124) /* (PDC_ADC) PDC Transfer Status Register*/
#define AT91C_ADC_TNCR  ((AT91_REG *) 	0xFFFD811C) /* (PDC_ADC) Transmit Next Counter Register*/
#define AT91C_ADC_RNCR  ((AT91_REG *) 	0xFFFD8114) /* (PDC_ADC) Receive Next Counter Register*/
#define AT91C_ADC_TCR   ((AT91_REG *) 	0xFFFD810C) /* (PDC_ADC) Transmit Counter Register*/
#define AT91C_ADC_RCR   ((AT91_REG *) 	0xFFFD8104) /* (PDC_ADC) Receive Counter Register*/
/* ========== Register definition for ADC peripheral ========== */
#define AT91C_ADC_IMR   ((AT91_REG *) 	0xFFFD802C) /* (ADC) ADC Interrupt Mask Register*/
#define AT91C_ADC_CDR4  ((AT91_REG *) 	0xFFFD8040) /* (ADC) ADC Channel Data Register 4*/
#define AT91C_ADC_CDR2  ((AT91_REG *) 	0xFFFD8038) /* (ADC) ADC Channel Data Register 2*/
#define AT91C_ADC_CDR0  ((AT91_REG *) 	0xFFFD8030) /* (ADC) ADC Channel Data Register 0*/
#define AT91C_ADC_CDR7  ((AT91_REG *) 	0xFFFD804C) /* (ADC) ADC Channel Data Register 7*/
#define AT91C_ADC_CDR1  ((AT91_REG *) 	0xFFFD8034) /* (ADC) ADC Channel Data Register 1*/
#define AT91C_ADC_CDR3  ((AT91_REG *) 	0xFFFD803C) /* (ADC) ADC Channel Data Register 3*/
#define AT91C_ADC_CDR5  ((AT91_REG *) 	0xFFFD8044) /* (ADC) ADC Channel Data Register 5*/
#define AT91C_ADC_MR    ((AT91_REG *) 	0xFFFD8004) /* (ADC) ADC Mode Register*/
